Revit 2027 API
ScheduleDefinition.GetSortGroupField Method
 Gets a sorting/grouping field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleSortGroupField GetSortGroupField(
	int index
)
Public Function GetSortGroupField (
	index As Integer
) As ScheduleSortGroupField
public:
ScheduleSortGroupField^ GetSortGroupField(
	int index
)
member GetSortGroupField :
        index : int -> ScheduleSortGroupField
Parameters
index Int32
 The index of the sorting/grouping field.
Return Value
ScheduleSortGroupField
 A copy of the sorting/grouping field.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid sorting/grouping field index.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace